{"data":{"markdownRemark":{"html":"<blockquote>\n<p>Vai da página 105 até 164</p>\n</blockquote>\n<h2>O que é Integração?</h2>\n<p><strong>É o grupo responsável pela unificação, integração e funcionamento, de acordo com o plano, de todos os outros grupos.</strong></p>\n<p>É o grupo de processos responsaveis pela centralização da gerência do projeto. Desde o seu inicio até o seu termino. É neste grupo que ficam as documentações gerenciais do projeto, como o escopo, documento de mudanças, escopo do projeto, entre outros.</p>\n<h2>O que faz a Integraçaõ?</h2>\n<ul>\n<li>Fornece um plano de gerenciamento do projeto</li>\n<li>Garante o controle das datas de entrega com base no plano</li>\n<li>Monitora o andamento do projeto e toma as medidas necessárias para atender os objetivos definidos</li>\n<li>Ser o meio de comunicação entre o projeto e as partes interessadas</li>\n<li>Encerrar formalmente as fases do projeto, inclusive ele</li>\n<li>Realizar o meio de campo das transiçoes de fase</li>\n</ul>\n<blockquote>\n<p>Diferente dos outros grupos, este é atribuido especificamente ao Gerente de Projetos</p>\n<p>Quanto mais complexo o projeto mais complexo fica a integração</p>\n</blockquote>\n<hr>\n<h2>Processos relacionados à Integração</h2>\n<h3><strong>1. Desenvolver Termo de Abertura do Projeto</strong></h3>\n<p>Um documento que formalmente oficializa o início de um projeto, bem como dá poderes organizacionais ao gerente de projetos.\nEle é utilizado basicamente para estabelcer uma parceria entre o solicitante e o organizador, em projetos externos, normalmente criam-se contratos que determinam estes fatores.</p>\n<p><strong>Nele vamos ter</strong></p>\n<ul>\n<li>Finalidade do Projeto.</li>\n<li>Objetivos do Projeto.</li>\n<li>Descrição de alto-nível do Projeto.</li>\n<li>Riscos gerais.</li>\n<li>Recursos financeiros pré-aprovados</li>\n<li>O que faz do projeto um sucesso.</li>\n<li>O que faz do projeto um fracasso.</li>\n<li>Gerente do projeto designado.</li>\n</ul>\n<p><strong>Recebemos</strong>\nBusiness Case, Acordos(<em>definição das intenções iniciais de um projeto, como um e-mail</em>), Fatores Ambientais do Negócio e Ativos de processos organizacionais.</p>\n<p><strong>Utilizamos</strong>\nOpinião de Especialistas, Coletas de Dados, Habilidades interepessoais de equipe e Reuniões.</p>\n<p><strong>Geramos</strong>\nTermo de Abertura do Projeto e Relatório de Premissas(<em>utilizado durante o projeto inteiro para registro de todas as premissas do projeto</em>)</p>\n<h3>2. Desenvolver Plano de Gerenciamento do Projeto</h3>\n<p>É um documento que descreve como o projeto irá ser executado, controlado e encerrado.\nEle serve como uma linha a ser seguida durante todo o decorrer do projeto, servindo de base para o trabalho que será executado.</p>\n<p><strong>Nele vamos ter</strong></p>\n<ul>\n<li><strong>Planos de gerenciamento auxiliares</strong> (Escopo, Requisitos, Cronograma, Custos, Qualidade, Recursos, Comunicações, Rsicos, Aquisições, Partes Interessadas).</li>\n<li><strong>Linhas de Base</strong> (Escopo, Cronograma, Custos).</li>\n</ul>\n<p><strong>Recebemos</strong>\nTermo de Abertura do Projeto, Saídas de Outros Processos, Fatores Ambientais do Negócio e Ativos Organizacionais.</p>\n<p><strong>Utilizamos</strong>\nOpinião de Especialistas, Coleta de dados, Habilidades Interpessoais e de Equipe e Reuniões</p>\n<p><strong>Geramos</strong>\nPlano de Gerenciamento do Projeto</p>\n<h3>3. Orientar e Gerenciar o Trabalho do Projeto</h3>\n<p>É basicamente, o processo de liderar e realizar o que ficou definido no plano de gerenciamento de projeto, além de implementar as mudanças para atingir os objetivos do projeto.</p>\n<p><strong>Recebemos</strong>\nPlano de Gerenciamento do Projeto, Documentos do Projeto, Solicitações de Mudanças Aprovadas, Fatores Ambientais da Empresa e Ativos de Processos Organizacionais.</p>\n<p><strong>Utilizamos</strong>\nOpinião Especializada, SIGP, Reuniões</p>\n<p><strong>Geramos</strong>\nDados de Desempenho(como o projeto está andando), <strong>Entregas</strong>, Solicitações de Mudanças, Atualiza de qualquer componente do plano de gerenciamento do projeto, atualização dos documentos do projeto e atualizações de ativos de processos organizacionais.</p>\n<blockquote>\n<p>SIGP é uma sigla para <strong>sistema de informações de gerenciamento de projetos</strong> que é basicamente um sistema que tem como objetivo, reunir feramentas que facilitam o gerenciamento das partes mais importantes de um projeto. Como o cronograma, autorização de trabalho, coleta de informações, entre outros.</p>\n</blockquote>\n<h3>4. Gerenciar o Conhecimento do Projeto</h3>\n<p>É o processo que envolve garantir que os conhecimentos da equipe do projeto e dos stakeholders sejam utilizados antes, durante e após o projeto. Ele visa documentar conhecimentos e criar uma atmosfera de confiança para que este conhecimento seja passado.</p>\n<p><strong>Recebemos</strong>\nPlano de Gerenciamento do Projeto, Documentos do Projeto, Entregas, Fatores Ambientais da Empresa e Ativos de Processos Organizacionais.</p>\n<p><strong>Utilizamos</strong>\nOpnião Especializada, Gerenciamento de Conhecimentos, Gerenciamento de Informações e Haiblidades Interpessoais e de Equipe</p>\n<p><strong>Geramos</strong>\nRegistro das lições aprendidas, Atualizações do Palno de Gerenciamento do Projeto e Atualizações de Ativos de Processos Organizacionais.</p>\n<h3>5. Monitorar e Controlar o Trabalho do Projeto</h3>\n<p>É o processo que visa monitor como está o andamento do projeto com relação ao que foi definido no plano de gerenciamento do projeto e a partir disto, verificar se precisam ser feitas modificações neste para garantir que o projeto permaneça alinhado com as necessidades do negócio.</p>\n<p><strong>Recebemos</strong>\nPlano de Gerenciamento do Projeto, Documentos do Projeto, Informações sobre o Desempenho do Trabalho, Acordos, Fatores Ambientais da Empresa e Ativos de Processos Organizacionais</p>\n<p><strong>Utilizamos</strong>\nOpnião Especializada, Análise de Dados, Tomada de Decisões e Reuniões.</p>\n<p><strong>Geramos</strong>\nRelatórios de Desempenho do Trabalho, Solicitações de Mudanças, Atualizaçoes do Plano de Gerenciamento do Projeto e Atualizações de Documentos do Projeto.</p>\n<h3>6. Realizar o Controle Integra de Mudanças</h3>\n<p>É o processo que tem como principal responsabilidade o gerenciamento de mudanças como a revisão das mudanças, aprovação e comunicação das decisões tomadas.\nEste processo ocorre do início ao fim do projeto e é de <strong>responsabilidade do gerente de projetos</strong> já que podem afetar o escopo do projeto e/ou do produto em questão.</p>\n<p><strong>Recebemos</strong>\nPlano de Gerenciamento do Projeto, Documentos do Projeto, Relatórios de Desempenho do Trabalho, Solicitações de Mudança, Fatores ambientais da empresa e Ativos de Processos Organizacionais.</p>\n<p><strong>Utilizamos</strong>\nOpinião Especializada, Ferramentas de Controle de Mudanças, Análise de Dados, Tomada de Decisões e Reuniões.</p>\n<p><strong>Geramos</strong>\nSolicitações de Mudança, Atualizações do Palno de Gerenciamento do Projeto e Atualizações de Documentos do Projeto.</p>\n<h3>7. Encerar o Projeto ou Fase</h3>\n<p>Este processo serve para, formalmente, realizar o encerramento do projeto, fase ou contrato, bem como o devido arquivamento de informações, conclusão do trabalho planejo e liberação de recursos organizacionais.\nEste processo precisa estar em linha com o plano de gerenciamento do projeto para garantir que o projeto cumpriu o seu objetivo. Caso não tenha cumprido, ou seja, foi encerrado antes da conclusão, precisa ser investigado o motivo bem como a documentação do mesmo.</p>\n<p><strong>Recebemos</strong>\nTermo de Abertura do Projeto, Plano de gerenciamento do Projeto, Documentos do Projeto, Entregas Aceitas, Documentos de Negócios, Acordos, Documentos de Aquisições e Ativos de Processos Organizacionais</p>\n<p><strong>Utilizamos</strong>\nOpnião Especializada, Análise de Dados e Reuniões</p>\n<p><strong>Geramos</strong>\nAtualizações de Documentos, Transição do Produto, Serviço ou resultado Final, Relatório Final e Atualizações de Ativos de Processos Organizacionais.</p>","frontmatter":{"tags":["Faculdade","Gestão de Projetos","Metodologia"],"title":"Grupo de Processo de Intergração do PMBOK","date":"04 outubro, 2018","description":"Estudos sobre o grupo de processo de Integração do PMBOK para a apresentação do seminário de Gestão de Projetos"}}},"pageContext":{"slug":"/drafts/apresentacao_integracao/"}}