{"errors":[{"message":"Expected Iterable, but did not find one for field frontmatter_2.categoria.","locations":[{"line":11,"column":11}],"path":["allMarkdownRemark","edges",0,"node","frontmatter","categoria"]}],"data":{"allMarkdownRemark":{"totalCount":4,"edges":[{"node":{"id":"eb756375-b6df-5359-9d42-71b68e413e68","frontmatter":{"tags":["Inteligência Artificial"],"title":"Sistemas Especialistas","date":"10 outubro, 2018","categoria":null,"description":"Explicação sobre o que são sistemas especialistas. Para o que eles servem. O que fazem. Como fazem. Do que são compostos."},"fields":{"slug":"/drafts/sistemas_especialistas/"},"excerpt":"O que são? É um  sistema computacional , que vai ser criado junto a um especialista da área para  alcançar a resolução de determinados problemas  e é formado por uma base de conhecimento de fatos e regras. É composto de Fatos e regras  que realizam a análise de problemas através de…"}},{"node":{"id":"815a09c6-363b-5bf9-8c03-2577f1be800c","frontmatter":{"tags":["Gestão de TI"],"title":"Introdução ao ITIL","date":"08 outubro, 2018","categoria":["Faculdade"],"description":"Introdução à metodologia do ITIL que tem como objetivo melhorar a qualidade dos serviços de TI prestados, através das melhores práticas do mercado"},"fields":{"slug":"/ITIL_aula01/"},"excerpt":"Como nasceu? Através de uma necessidade do governo britânico de um manual de melhores práticas e procedimentos de TI. O que é? Uma metodologia/melhores práticas para o gerenciamento de serviços de TI. Não é um modelo rígido. Pra que serve? Melhorar a qualidade e eficiência dos serviços de…"}},{"node":{"id":"23332104-11ce-5ac3-92e8-8cb72cd51d98","frontmatter":{"tags":["Tópicos"],"title":"Aula de Redes Neurais","date":"05 outubro, 2018","categoria":["Faculdade"],"description":"Relatório da aula de Tópicos onde foi dada uma introdução sobre o conceito de redes neurais e uma implementação simples em python"},"fields":{"slug":"/redes_neurais/"},"excerpt":"Redes Neurais Artificiais Representação de um neurônio artificial Um conjunto de sinapses ou elos de ligação Somador para as entradas iniciais Função de ativação para restringir a saída do neuronio Professor não sabe explicar o motivo da existência da variável bias. Função de Ativação…"}},{"node":{"id":"864fe010-30d6-5d5a-8c56-2904cb1797f7","frontmatter":{"tags":["Gestão de Projetos"],"title":"Seminário do Grupo de Processo de Intergração","date":"04 outubro, 2018","categoria":["Faculdade"],"description":"Estudos sobre o grupo de processo de Integração do PMBOK para a apresentação do seminário de Gestão de Projetos"},"fields":{"slug":"/apresentacao_integracao/"},"excerpt":"O que é Integração? O que faz a Integraçaõ? Fornece um plano de gerenciamento do projeto Garante o controle das datas de entrega com base no plano Monitora o andamento do projeto e toma as medidas necessárias para atender os objetivos definidos Ser o meio de comunicação entre o projeto e…"}}]}},"pageContext":{}}