{"data":{"markdownRemark":{"html":"<h2>História</h2>\n<p>Atualmente, o primeiro trabalho reconhecido como sendo da área da inteligência artificial é de dois pesquisadores, Warren McCulloch e Walter Pitts, que propuseram em 1943 um modelo de neuronio artificiais onde cada neurônio seria identificado como estando \"ligado\" ou \"desligado\".</p>\n<p>Já em 1950, Alan Turing publicou seu artigo denominado \"Computing Machinery and Intelligence\" que basicamente fornece uma visão completa da Inteligência Artificial naquela época. Com ele também tivemos o Teste de Turing.</p>\n<blockquote>\n<p>\"Se um humano não pode reconhecer se as respostas vem de um computador ou de uma máquina, então a máquina pode ser considerada inteligente.\"</p>\n</blockquote>\n<p>Em 1956, John McCarty organizou uma conferência de dois meses no <em>Darthmouth College</em> onde o nome \"Inteligência Artificial\" foi dado pelo próprio John McCarty. Este event, na época em que aconteceu, não trouxa nada de revolucionário para a área, porém durante os próximos 20 anos depois de seu acontecimento, o campo da Inteligência Artificial foi dominado por estas pessoas que estavam presentes, depois seus estudantes e colegas nas faculdades mais conceituadas.</p>\n<p>Entre 1956, quando o termo foi concebido, até 1996 diversos conceitos de IA foram criados, porém lhes faltava poder de processamento para que essa área realmente fosse para frente e chegasse aos olhos do grande público. Foi até 1996 pois foi neste ano que pela primeira vez na história um computador foi capaz de ganhar do melhor jogador de xadrez de todos os tempos, Garry Kasparov e este computador se chamava <strong>Deep Blue</strong>. Apesar de ter ganhado, o Deep Blue utilizava-se de força bruta, porém, em 2016 o software <strong>AplhaGo(Google)</strong> foi capaz de vencer o número um de um jogo de estratégia chamado Go utilizando tanto força bruta quanto aprendizado de máquina, onde ele foi capaz de aprender sozinho quais eram as melhores estratégias para cada tipo de jogador.</p>\n<h2>Definição Básica</h2>\n<h2>Aplicabilidade</h2>\n<h2>Dias Atuais</h2>","frontmatter":{"tags":["Faculdade","Inteligência Artificial","Algoritmo Genético"],"title":"Entendendo Algoritmo Genético","date":"21 outubro, 2018","description":"Um estudo sobre o que é, de onde veio, para onde vai uma das áreas da inteligência artificial chamada de computação evolutiva."}}},"pageContext":{"slug":"/drafts/algoritmo_genetico/"}}