{"data":{"markdownRemark":{"html":"<h2>Como nasceu?</h2>\n<p>Através de uma necessidade do governo britânico de um manual de melhores práticas e procedimentos de TI.</p>\n<h2>O que é?</h2>\n<p>Uma metodologia/melhores práticas para o gerenciamento de serviços de TI.</p>\n<blockquote>\n<p>Não é um modelo rígido.</p>\n</blockquote>\n<h2>Pra que serve?</h2>\n<p>Melhorar a qualidade e eficiência dos serviços de TI através de manuais(livros) com as melhores práticas de cada área.</p>\n<blockquote>\n<p>É divido em livros onde cada um aborda um tema.</p>\n</blockquote>\n<hr>\n<h2>Como Funciona?</h2>\n<p>Seu núcleo é formado por duas partes.</p>\n<h3>1. Operacional/Suporte a Serviços</h3>\n<p>mão de obra operacional para entrega dos serviços.</p>\n<p><em>Exemplo: Estou com problema na rede.</em></p>\n<ul>\n<li><strong>Clientes</strong>: propietários/donos dos serviços de TI.</li>\n<li><strong>Usuário</strong>: usuário final que pertence a um cliente.</li>\n<li><strong>Super-usuários ou Especialistas</strong>: pessoas designadas para agir como primeiro contato para incidentes e problemas.</li>\n</ul>\n<h4>Gerenciamento da Configuração</h4>\n<p><strong>Objetivos</strong>: prover informações, monitorar e controlar a infra de TI.</p>\n<p><strong>Responsabilidades</strong>: identificar, controlar, prestar contas sobre <em>IC's</em>, além de dar informações para auditoria.</p>\n<blockquote>\n<p>IC é um hardware ou software(ativo) que deve possuir uma identificação única, como por exemplo uma placa de identificação de ativos fixo.</p>\n<p>BDGM é um banco de dados contendo todos os dados relevantes à um IC (Não é recomendado que seja um excel).</p>\n</blockquote>\n<h4>Central de Serviços</h4>\n<h5>Nível 0 - Gerenciamento de chamados</h5>\n<ul>\n<li><strong>Objetivos</strong>: facilitar a restauração de serviços de forma rápida, através de um único canal de comunicação além de informar o usuário sobre o status dos chamados.</li>\n<li><strong>Responsabilidades</strong>: Gerenciar o ciclo de vida dos chamados, fazer o escalonamento/encaminhamento correto destes, além de servir como recepção, registro e acompnhamento de chamados.</li>\n</ul>\n<h5>Nível 1 - Gerenciamento de Incidentes</h5>\n<ul>\n<li>\n<p><strong>Objetivos</strong>: avaliar se o incidente pode ocorrer novamente, informar o gerente de problemas e manter uma comunicação contínua com o usuário.</p>\n</li>\n<li>\n<p><strong>Responsabilidades</strong>: Investigação não detalhada e diagnóstico.</p>\n</li>\n</ul>\n<blockquote>\n<p>Não é função da Gerencia de Incidentes, analisar e estudar o problema.</p>\n<p>Incidente é qualquer evento que possa causar a parada ou perca de qualidade de um serviço.</p>\n<p>Requisição de Serviço é a solicitação de algo novo, que não é uma falha.</p>\n</blockquote>\n<h5>Nível 2 - Gerente de Problemas</h5>\n<p><strong>Objetivos</strong>: Encontrar a causa raiz dos problemas, para poder previnir futuros incidentes que podme vir a ocorrrer.</p>\n<p><strong>Responsabilidades</strong>: Gerar informações gerenciais, se atualizar e se previnir sobre problemas que podem vir a ocorrer, além de dar apoio na resolução de problemas mais graves.</p>\n<blockquote>\n<p>Um dos beneficios é a melhora de soluções referente à incidentes que já ocorreram, através da geração de conhecimento.</p>\n<p>Problema é uma causa raiz desconhecida</p>\n<p>Erro é uma causa raiz conhecida</p>\n<p>Erro conhecido é um erro no qual foi identificada uma solução</p>\n</blockquote>\n<hr>\n<h3>2. Gerencial/Entrega de Serviços</h3>\n<p>Mais entendido como consulta de dados.</p>\n<p><em>Exemplo: preciso de uma informação referente ao preço do notebook x</em></p>\n<p>Analisam o ambiente para <strong>prover informações para a Central de Serviço</strong></p>\n<h4>Objetivos</h4>\n<ul>\n<li>Equilibrio entre demanda e capacidade</li>\n<li>Melhoria continua da qualidade do serviço</li>\n<li>Gerar KPIs</li>\n</ul>\n<blockquote>\n<p>O contrato entre as empresas deve verificar os acordos de níveis de serviço para definição de prioridades.</p>\n</blockquote>\n<h4>Responsabilidades (Varia conforme o tipo de serviço)</h4>\n<ul>\n<li>\n<p>Manter os documentos a seguir:</p>\n<ul>\n<li>Catálogo de Serviços</li>\n<li>Acordo de Nível de Serviço</li>\n</ul>\n</li>\n</ul>\n<h4>1. Gerenciamento de Responsabilidades</h4>\n<p><strong>Objetivo</strong> Garantir que os serviços sejam entregues com base no acordo entre a organização de TI e os clientes.</p>\n<p><strong>Responsabilidades</strong> Produzir um plano de disponibilidades; gerar KPI para monitorar os níveis de disponbilidade para garantir os ANSs e ANOs; </p>\n<h4>2. Gerenciamento da Capacidade</h4>\n<p><strong>Objetivo</strong> Garantir que a capacidade de processamento e amrazenamentos do serviços fornecidos acompanhem as demandas do negócio de maneira efetiva.</p>\n<p><strong>Responsabilidade</strong>\nGerenciar a capacidade do negócio, do serviço oferecido e dos recursos. </p>\n<h4>3. Gerenciamento Financeiro</h4>\n<p><strong>Objetivo</strong>\nAdministar os recursos monetários da TI para fins de organização, como por exemplo, dimensionar o custo da TI.</p>\n<p><strong>Responsabilidade</strong>\nPrever o orçamento, verificar como o dinheiro foi gasto e cobrar o cliente sobre o pagamento(faturar).</p>\n<h4>4. Gerenciamento da Continuidade do Serviços</h4>\n<p><strong>Objetivos</strong>\nGarantir que todo o aparato técnico de TI possa ser recuperado dentro dos prazos de negócio necessários e acordados (Estilo a disponibilidade/continuidade de <em>datacenters</em>)</p>\n<p><strong>Responsabilidade</strong>\nCriar e manter o plano de continuidade da TI</p>","frontmatter":{"tags":["Faculdade","Gestão de TI","Metodologias"],"title":"Introdução ao ITIL","date":"08 outubro, 2018","description":"Introdução à metodologia do ITIL que tem como objetivo melhorar a qualidade dos serviços de TI prestados, através das melhores práticas do mercado"}}},"pageContext":{"slug":"/ITIL/"}}