{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"8236f5e0-463c-5823-b1c6-66d2138af4a2","frontmatter":{"tags":["Faculdade","Inteligência Artificial","Algoritmo Genético"],"title":"Entendendo Algoritmo Genético","date":"21 outubro, 2018","description":"Um estudo sobre o que é, de onde veio, para onde vai uma das áreas da inteligência artificial chamada de computação evolutiva."},"fields":{"slug":"/drafts/algoritmo_genetico/"},"excerpt":"História Meados do século 19 Os naturalistas acreditava que cada espécie havia sido criada separadamente por um ser supremo ou geração espontânea. Pois bem, tudo isso muda em 1859, quando Charles Darwin juntamente com Alfred Russel Wallace publicam o \"Origem das Espécies\" com toda a sua…"}},{"node":{"id":"8fd05793-83f3-5672-aeef-8566f9673235","frontmatter":{"tags":["Faculdade","Inteligência Artificial"],"title":"Sistemas Especialistas","date":"10 outubro, 2018","description":"Explicação sobre o que são sistemas especialistas. Para o que eles servem. O que fazem. Como fazem. Do que são compostos."},"fields":{"slug":"/sistemas_especialistas/"},"excerpt":"O que são? São  sistemas computacionais , que vão ser criados junto de um especialista da área para  alcançar a resolução de determinados problemas  e são formados por uma  base de conhecimento de fatos e regras. São compostos de Fatos e regras  que realizam a análise de problemas através…"}},{"node":{"id":"3a67971c-d73e-5243-a149-4af02dedeaf7","frontmatter":{"tags":["Faculdade","Gestão de TI","Metodologias"],"title":"Introdução ao ITIL","date":"08 outubro, 2018","description":"Introdução à metodologia do ITIL que tem como objetivo melhorar a qualidade dos serviços de TI prestados, através das melhores práticas do mercado"},"fields":{"slug":"/ITIL/"},"excerpt":"Como nasceu? Através de uma necessidade do governo britânico de um manual de melhores práticas e procedimentos de TI. O que é? Uma metodologia/melhores práticas para o gerenciamento de serviços de TI. Não é um modelo rígido. Pra que serve? Melhorar a qualidade e eficiência dos serviços de…"}},{"node":{"id":"23332104-11ce-5ac3-92e8-8cb72cd51d98","frontmatter":{"tags":["Faculdade","Tópicos","Python"],"title":"Aula de Redes Neurais","date":"05 outubro, 2018","description":"Relatório da aula de Tópicos onde foi dada uma introdução sobre o conceito de redes neurais e uma implementação simples em python"},"fields":{"slug":"/redes_neurais/"},"excerpt":"Redes Neurais Artificiais Representação de um neurônio artificial Um conjunto de sinapses ou elos de ligação Somador para as entradas iniciais Função de ativação para restringir a saída do neuronio Professor não sabe explicar o motivo da existência da variável bias. Função de Ativação…"}},{"node":{"id":"8cd60b32-9a44-55e2-8a37-937649680e2b","frontmatter":{"tags":["Faculdade","Gestão de Projetos","Metodologia"],"title":"Grupo de Processo de Intergração do PMBOK","date":"04 outubro, 2018","description":"Estudos sobre o grupo de processo de Integração do PMBOK para a apresentação do seminário de Gestão de Projetos"},"fields":{"slug":"/drafts/apresentacao_integracao/"},"excerpt":"Vai da página 105 até 164 O que é Integração? É o grupo responsável pela unificação, integração e funcionamento, de acordo com o plano, de todos os outros grupos. É o grupo de processos responsaveis pela centralização da gerência do projeto. Desde o seu inicio até o seu termino. É neste…"}}]}},"pageContext":{}}