{"data":{"markdownRemark":{"html":"<h2>História</h2>\n<h3>Século 19</h3>\n<p>Até meados do século 19, os naturalistas acreditava que cada espécie havia sido criada separadamente por um ser supremo ou geração espontânea. Pois bem, tudo isso muda em 1859, quando Charles Darwin juntamente com Alfred Russel Wallace publicam o \"Origem das Espécies\" com toda a sua teoria sustentada por evidências que obteve a bordo do Beagle.</p>\n<p>Este trabalho influenciou diversos campos de estudo e juntamente com o trabalho de Gregor Mendel sobre os princípio básicos de herança genética de 1865, formam o que é chamado de a moderna teoria da evolução que engloba o principio básico da Genética populacional: <strong>A variablidade entre indivíduos em uma população de organismos que se reproduzem sexualmente é produzida pela mutação e pela recombinação genética.</strong> </p>\n<p>Atualmente, o primeiro trabalho reconhecido como sendo da área da inteligência artificial é de dois pesquisadores, Warren McCulloch e Walter Pitts, que propuseram em 1943 um modelo de neuronio artificiais onde cada neurônio seria identificado como estando \"ligado\" ou \"desligado\".</p>\n<p>Já em 1950, Alan Turing publicou seu artigo denominado \"Computing Machinery and Intelligence\" que basicamente fornece uma visão completa da Inteligência Artificial naquela época. Com ele também tivemos o Teste de Turing.</p>\n<blockquote>\n<p>\"Se um humano não pode reconhecer se as respostas vem de um computador ou de uma máquina, então a máquina pode ser considerada inteligente.\"</p>\n</blockquote>\n<p>Em 1956, John McCarty organizou uma conferência de dois meses no <em>Darthmouth College</em> onde o nome \"Inteligência Artificial\" foi dado pelo próprio John McCarty. Este event, na época em que aconteceu, não trouxa nada de revolucionário para a área, porém durante os próximos 20 anos depois de seu acontecimento, o campo da Inteligência Artificial foi dominado por estas pessoas que estavam presentes, depois seus estudantes e colegas nas faculdades mais conceituadas.</p>\n<p>Algumas pesquisas já haviam sido feitas na área da genética computacional, porém foi com John Holland que tivemos um marco nesta área, já que em 1975 publicou o livro \"Adaptation in Natural and Artificial Systems\" que atualmente é considerado como a bíblia de algoritmo genético. Holland introduziu um teorema para predizer a qualidade da próxima geração e com isto explicou porque os algortimos genéticos poderiam performar melhor que por exemplo uma busca aleatória.</p>\n<p>De lá para ca, diversos avanços e estudos foram feitos nesta area com sucessos nos mais diversos problemas de otimização e aprendizado de máquina.</p>\n<h2>O que é um algoritmo genético?</h2>\n<blockquote>\n<p>São métodos de busca baseados na evolução natural e recombinação genética considerando a teoria da Darwin sobre a sobrevivência dos mais aptos.</p>\n</blockquote>\n<p>Basicamente, os indivíduos de uma determinada população competem por recursos finitos, parceiros e abrigo. O mais aptos a terem estes recursos terão mais possibilidade de se relacionar com um parceiro e consequentemente passarão seus genes mais \"aptos\" para próxima geração, enquanto que os outros, menos aptos, terão menor probabilidade. Sendo assim, os genes dos indivíduos mais aptos irão se propagar com maior intensidade na população onde residem produzindo assim, descendentes melhores que seus antecessores, criando uma escala evolutiva de adaptação.</p>\n<p>Pensando dessa forma, podemos afirmar que cada indivíduo é uma possível solução. Isso tansformado em código se representa em uma lista de tamanho finito. Podemos dizer que a lista é o cromossomo do indivíduo e os itens que a compõe, seus genes.</p>\n<p>A partir destas listas, é feita uma pontuação para cada indivíduo, como se estivessemos avaliando sua aptidão para um determinado ambiente. Sendo o ambiente o resultado que queremos obter, e a avaliação o quão próximo o indivíduo está do resultado esperado.</p>\n<p>Com esta pontuação, podemos combinar os melhores indivíduos produzindo novas e melhores gerações.</p>\n<blockquote>\n<blockquote>\n<p>Ok, mas e quando nós paramos de gerar novas gerações?</p>\n</blockquote>\n</blockquote>\n<p>O critério de parada ocorre quando a geração seguinte não apresenta diferenças significativas com relação à geração anterior. Caso isso ocorra, podemos dizer que o sistema convergeiu para um melhor resultado, ou simplesmente que obtivemos a convergência do sistema.</p>\n<blockquote>\n<blockquote>\n<p>Legal, entendi como é o conceito, mas como que realmente funciona? Início, meio e fim?</p>\n</blockquote>\n</blockquote>\n<p>Bem, tudo começa com uma população aleatória de indivíduos, após isso são selecionados os mais aptos e entre eles, ocorre o cruzamento e a mutação aleatória, produzindo uma nova população que esperasse que seja melhor que a anterior.</p>\n<p>Então temos os seguintes passos:</p>\n<ol>\n<li><strong>Criação</strong> de uma população de indivíduos que são representados em uma linha finita e que pode ser binária, ou seja, ser constituida de \"0\"s e \"1\"s.</li>\n<li><strong>Seleção</strong> alguns indivíduos que são os melhores adaptados para a criação de descendentes melhores que seus antecessores.</li>\n<li>\n<p><strong>Aplicar os Operadores Genéticos</strong></p>\n<ul>\n<li><strong>Cruzamento</strong> que é a combinação de suas informações genéticas a fim de produzir um indivíduo melhor. A probabilidade do cruzamento ocorrer é definido pela <em>taxa de cruzamento</em>.</li>\n<li><strong>Mutação</strong> que é a alteração das informações genéticas de alguns indivíduos definidos pela <em>taxa de mutação.</em></li>\n</ul>\n</li>\n</ol>\n<h2>Aplicabilidade</h2>\n<h2>Dias Atuais</h2>\n<hr>\n<h2>Referências</h2>\n<h3>Algoritmo Genético</h3>\n<p><a href=\"http://www.cear.ufpb.br/juan/wp-content/uploads/2016/08/Aula-2c-Exemplo-de-AG.pdf\">http://www.cear.ufpb.br/juan/wp-content/uploads/2016/08/Aula-2c-Exemplo-de-AG.pdf</a>\n<a href=\"http://www.computacaointeligente.com.br/algoritmos/o-algoritmo-genetico-ga/\">http://www.computacaointeligente.com.br/algoritmos/o-algoritmo-genetico-ga/</a>\nftp://ftp.dca.fee.unicamp.br/pub/docs/vonzuben/theses/pvargas<em>mest/arq</em>11.pdf\n<a href=\"http://conteudo.icmc.usp.br/pessoas/andre/research/genetic/\">http://conteudo.icmc.usp.br/pessoas/andre/research/genetic/</a>\n<a href=\"https://www.youtube.com/watch?v=x7oHgs52BAI&#x26;t=151s\">https://www.youtube.com/watch?v=x7oHgs52BAI&#x26;t=151s</a>\n<a href=\"https://www.researchgate.net/publication/247935438_Conceitos_Basicos_de_Algoritmos_Geneticos_Teoria_e_Pratica\">https://www.researchgate.net/publication/247935438<em>Conceitos</em>Basicos<em>de</em>Algoritmos<em>Geneticos</em>Teoria<em>e</em>Pratica</a>\nftp://ftp.dca.fee.unicamp.br/pub/docs/vonzuben/theses/emi<em>mest/cap3.pdf\n<a href=\"https://bcc.ime.usp.br/tccs/2003/anselmo/node12.html\">https://bcc.ime.usp.br/tccs/2003/anselmo/node12.html</a>\n<a href=\"http://edirlei.3dgb.com.br/aulas/ia\">http://edirlei.3dgb.com.br/aulas/ia</a></em>2012<em>1/IA</em>Aula<em>04</em>Algoritmos_Geneticos.pdf\n<a href=\"http://www.professor.webizu.org/ga/gaintro.html\">http://www.professor.webizu.org/ga/gaintro.html</a>\n<a href=\"http://algoritmogeneticouba.blogspot.com/2012/11/historia-de-los-algoritmos-geneticos.html\">http://algoritmogeneticouba.blogspot.com/2012/11/historia-de-los-algoritmos-geneticos.html</a></p>\n<h3>Inteligência Artificial</h3>\n<p><a href=\"https://transformacaodigital.com/o-que-e-inteligencia-artificial/\">https://transformacaodigital.com/o-que-e-inteligencia-artificial/</a>\n<a href=\"http://blog.timo.com.br/afinal-o-que-e-inteligencia-artificial-teste-de-turing/\">http://blog.timo.com.br/afinal-o-que-e-inteligencia-artificial-teste-de-turing/</a>\n<a href=\"https://www.androidpit.com.br/o-que-e-inteligencia-artificial\">https://www.androidpit.com.br/o-que-e-inteligencia-artificial</a>\n<a href=\"https://smarttudo.com.br/blogs/news/inteligencia-artificial\">https://smarttudo.com.br/blogs/news/inteligencia-artificial</a>\n<a href=\"https://blogue.rbe.mec.pt/pequena-historia-da-inteligencia-2162713\">https://blogue.rbe.mec.pt/pequena-historia-da-inteligencia-2162713</a>\n<a href=\"https://tecnoblog.net/195106/inteligencia-artificial-historia-dilemas/\">https://tecnoblog.net/195106/inteligencia-artificial-historia-dilemas/</a>\n<a href=\"https://medium.com/@eliezerfb/intelig%C3%AAncia-artificial-499fc2c4aa79\">https://medium.com/@eliezerfb/intelig%C3%AAncia-artificial-499fc2c4aa79</a>\n<a href=\"http://www.scielo.br/scielo.php?script=sci_arttext&#x26;pid=S0100-19651997000100006\">http://www.scielo.br/scielo.php?script=sci_arttext&#x26;pid=S0100-19651997000100006</a></p>","frontmatter":{"tags":["Faculdade","Inteligência Artificial","Algoritmo Genético"],"title":"Entendendo Algoritmo Genético","date":"21 outubro, 2018","description":"Um estudo sobre o que é, de onde veio, para onde vai uma das áreas da inteligência artificial chamada de computação evolutiva."}}},"pageContext":{"slug":"/drafts/algoritmo_genetico/"}}